test/performance-test.yml
config:
  target: 'http://localhost:3000' # Altere para o URL da sua API
  phases:
    - duration: 60 # Duração do teste em segundos
      arrivalRate: 5 # Quantas requisições por segundo
  http:
    request:
      headers:
        Content-Type: application/json

scenarios:
  - flow:
      - get:
          url: "/api/items" # Altere para o endpoint que deseja testar
      - post:
          url: "/api/items"
          json:
            name: "Item {{ $randomInt(1, 1000) }}"
            description: "Performance test item"